#### Terraform Format and Style 🖌`success`

<details><summary>Format Output</summary>

```


```

</details>

#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

"data.terraform_remote_state.stacks: Reading...
data.terraform_remote_state.stacks_platform_platform-k8s: Reading...
module.grafana_rds.module.db_instance.data.aws_iam_policy_document.enhanced_monitoring: Reading...
module.grafana_rds.module.db_instance.data.aws_partition.current: Reading...
module.grafana_rds.module.db_instance.data.aws_partition.current: Read complete after 0s [id=aws]
module.grafana_rds.module.db_instance.data.aws_iam_policy_document.enhanced_monitoring: Read complete after 0s [id=1813475199]
data.terraform_remote_state.stacks: Read complete after 1s
data.terraform_remote_state.stacks_platform_platform-k8s: Read complete after 1s

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_route53_record.rds_private will be created
  + resource "aws_route53_record" "rds_private" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "grafana-rds.dev.private.ktech-br.com"
      + records         = (known after apply)
      + ttl             = 300
      + type            = "CNAME"
      + zone_id         = "Z02765381ZWPFHXY30HZH"
    }

  # module.sg_grafana_db.aws_security_group.this_name_prefix[0] will be created
  + resource "aws_security_group" "this_name_prefix" {
      + arn                    = (known after apply)
      + description            = "Allow connections from Platform K8S Cluster to Grafana Database"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = (known after apply)
      + name_prefix            = "grafana_db-dev-"
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "grafana_db-dev"
        }
      + tags_all               = {
          + "Env"            = "dev"
          + "ManagedBy"      = "Terraform"
          + "Name"           = "grafana_db-dev"
          + "OrchestratedBy" = "Terramate"
          + "Stack"          = "platform-k8s-apps-grafana-dashboards"
          + "StackPath"      = "/stacks/platform/platform-k8s/apps/grafana-dashboards"
        }
      + vpc_id                 = "vpc-0104d0f25fbcf76fc"
    }

  # module.sg_grafana_db.aws_security_group_rule.ingress_with_source_security_group_id[0] will be created
  + resource "aws_security_group_rule" "ingress_with_source_security_group_id" {
      + description              = "PostgreSQL access from within VPC for Platform EKS Nodes"
      + from_port                = 5432
      + id                       = (known after apply)
      + prefix_list_ids          = []
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = "sg-0b634463f44c76414"
      + to_port                  = 5432
      + type                     = "ingress"
    }

  # module.sg_grafana_db.aws_security_group_rule.ingress_with_source_security_group_id[1] will be created
  + resource "aws_security_group_rule" "ingress_with_source_security_group_id" {
      + description              = "PostgreSQL access from within VPC for Platform EKS Cluster"
      + from_port                = 5432
      + id                       = (known after apply)
      + prefix_list_ids          = []
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = jsonencode(
            [
              + null,
            ]
        )
      + to_port                  = 5432
      + type                     = "ingress"
    }

  # module.grafana_rds.module.db_instance.aws_db_instance.this[0] will be created
  + resource "aws_db_instance" "this" {
      + address                               = (known after apply)
      + allocated_storage                     = 10
      + allow_major_version_upgrade           = false
      + apply_immediately                     = false
      + arn                                   = (known after apply)
      + auto_minor_version_upgrade            = true
      + availability_zone                     = (known after apply)
      + backup_retention_period               = (known after apply)
      + backup_window                         = (known after apply)
      + ca_cert_identifier                    = (known after apply)
      + character_set_name                    = (known after apply)
      + copy_tags_to_snapshot                 = false
      + db_name                               = "grafana"
      + db_subnet_group_name                  = jsonencode(
            [
              + null,
            ]
        )
      + delete_automated_backups              = true
      + deletion_protection                   = false
      + endpoint                              = (known after apply)
      + engine                                = "postgres"
      + engine_version                        = "14.1"
      + engine_version_actual                 = (known after apply)
      + final_snapshot_identifier             = (known after apply)
      + hosted_zone_id                        = (known after apply)
      + iam_database_authentication_enabled   = false
      + id                                    = (known after apply)
      + identifier                            = "grafana-rds-dev"
      + identifier_prefix                     = (known after apply)
      + instance_class                        = "db.t3.small"
      + iops                                  = 0
      + kms_key_id                            = (known after apply)
      + latest_restorable_time                = (known after apply)
      + license_model                         = (known after apply)
      + maintenance_window                    = (known after apply)
      + max_allocated_storage                 = 20
      + monitoring_interval                   = 0
      + monitoring_role_arn                   = (known after apply)
      + multi_az                              = false
      + name                                  = (known after apply)
      + nchar_character_set_name              = (known after apply)
      + network_type                          = (known after apply)
      + option_group_name                     = (known after apply)
      + parameter_group_name                  = (known after apply)
      + password                              = (sensitive value)
      + performance_insights_enabled          = false
      + performance_insights_kms_key_id       = (known after apply)
      + performance_insights_retention_period = (known after apply)
      + port                                  = 5432
      + publicly_accessible                   = false
      + replica_mode                          = (known after apply)
      + replicas                              = (known after apply)
      + resource_id                           = (known after apply)
      + skip_final_snapshot                   = false
      + snapshot_identifier                   = (known after apply)
      + status                                = (known after apply)
      + storage_encrypted                     = false
      + storage_throughput                    = (known after apply)
      + storage_type                          = (known after apply)
      + tags_all                              = {
          + "Env"            = "dev"
          + "ManagedBy"      = "Terraform"
          + "OrchestratedBy" = "Terramate"
          + "Stack"          = "platform-k8s-apps-grafana-dashboards"
          + "StackPath"      = "/stacks/platform/platform-k8s/apps/grafana-dashboards"
        }
      + timezone                              = (known after apply)
      + username                              = "grafana_usr"
      + vpc_security_group_ids                = (known after apply)

      + timeouts {}
    }

  # module.grafana_rds.module.db_instance.random_id.snapshot_identifier[0] will be created
  + resource "random_id" "snapshot_identifier" {
      + b64_std     = (known after apply)
      + b64_url     = (known after apply)
      + byte_length = 4
      + dec         = (known after apply)
      + hex         = (known after apply)
      + id          = (known after apply)
      + keepers     = {
          + "id" = "grafana-rds-dev"
        }
    }

  # module.grafana_rds.module.db_parameter_group.aws_db_parameter_group.this[0] will be created
  + resource "aws_db_parameter_group" "this" {
      + arn         = (known after apply)
      + description = "grafana-rds-dev parameter group"
      + family      = "postgres14"
      + id          = (known after apply)
      + name        = (known after apply)
      + name_prefix = "grafana-rds-dev-"
      + tags        = {
          + "Name" = "grafana-rds-dev"
        }
      + tags_all    = {
          + "Env"            = "dev"
          + "ManagedBy"      = "Terraform"
          + "Name"           = "grafana-rds-dev"
          + "OrchestratedBy" = "Terramate"
          + "Stack"          = "platform-k8s-apps-grafana-dashboards"
          + "StackPath"      = "/stacks/platform/platform-k8s/apps/grafana-dashboards"
        }
    }

Plan: 7 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
Releasing state lock. This may take a few moments...
"

```

</details>

*Pusher: @kaio6fellipe, Action: `pull_request`, Workflow: `Terraform plan`*